'''
calcualte tokens
'''

a = '''
新编经济法教程
（二）财产保全的范围和措施
财产保全的范围，限于申请人请求的范围，或者与本案有关的财产。财产
保全的措施有查封、扣押、冻结或者法律规定的其他方法。
（三）财产保全程序
（1）申请人提出申请。
（2）责令申请人提供担保。
（3）人民法院审查并做出裁定。
（4）执行。保全裁定一旦做出就立即执行。
（5）财产保全的解除。财产保全因下列法定情形而解除：①法院生效的
文书开始执行；②财产保全的原因和条件不存在或发生变化；③被申请人提
担保的；④诉前财产保全申请人在采取保全措施后十五日内不提起诉的。
二、先予执行
（一）先予执行的概念
先予执行是指人民法院在对案件做出判决之前，根据申请，为解决当事人
一方生活或生产经营之急，裁定另一方当事人先行给付申请人一定财物、实
施或停止某种行为实施并立即执行的法律制度。
（二）先予执行的适用范围和条件
1.先予执行的适用范围
根据《民事诉讼法》第九十七条的规定，先予执行只适用于以下几类
案件：
（1）追索赡养费、抚养费、抚育费、医疗费、抚恤金的案件。
（2）因紧迫情况需要执行的案件。
（3）因紧急情况需要先予执行的案件。
2.先予执行须具备的条件
《民事诉讼法》第九十八条的规定，先予执行必须具备以下条件：
（1）
'''